AccumulationRegisters/упИнкассацияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упИнкассацияДенежныхСредств</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/упСпособыУчетаИнкассируемыхЦенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыУчетаИнкассируемыхЦенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВЦеломПоЗаявкеНаПеревозкуГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СТочностьюДоГрузовыхМест</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/упИнкассация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ФормированиеДвижений

// Формирование движения по регистру "упИнкассацияДенежныхСредств".
//
Процедура СформироватьДвиженияИнкассацияДенежныхСредств(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт

	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
		
	ДвиженияИнкассация	= Движения.упИнкассацияДенежныхСредств;
	ДвиженияИнкассация.Записывать = Истина;
	
	ДвижениеИнкассация = ДвиженияИнкассация.Добавить();
	ДвижениеИнкассация.Период               	= Реквизиты.Дата;
	ДвижениеИнкассация.Регистратор          	= Ссылка;
	ДвижениеИнкассация.ЗаявкаНаПеревозкуГруза 	= Реквизиты.ЗаявкаНаПеревозкуГруза;
	ДвижениеИнкассация.Валюта 					= Реквизиты.Валюта;
	ДвижениеИнкассация.СуммаПлан				= 0;
	ДвижениеИнкассация.СуммаФакт				= Реквизиты.Сумма;
		
КонецПроцедуры

#КонецОбласти

Функция ИспользуетсяСпособУчетаИнкассируемыхЦенностейСТочностьюДоГрузовыхМест(ВидПеревозки) Экспорт
	
	Результат = Ложь;
	
	ИспользуютсяУслугиИнкассации 				= Ложь; 
	СпособУчетаИнкассируемыхЦенностей			= Перечисления.упСпособыУчетаИнкассируемыхЦенностей.ПустаяСсылка();
		
	Если ЗначениеЗаполнено(ВидПеревозки) Тогда
		сткЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидПеревозки, "ИспользуютсяУслугиИнкассации, СпособУчетаИнкассируемыхЦенностей");
		ИспользуютсяУслугиИнкассации 				= сткЗначенияРеквизитов.ИспользуютсяУслугиИнкассации;
		СпособУчетаИнкассируемыхЦенностей			= сткЗначенияРеквизитов.СпособУчетаИнкассируемыхЦенностей
	КонецЕсли;
	
	Результат = ПолучитьФункциональнуюОпцию("упИспользуютсяУслугиИнкассации") 
					И ИспользуютсяУслугиИнкассации 
					И СпособУчетаИнкассируемыхЦенностей = Перечисления.упСпособыУчетаИнкассируемыхЦенностей.СТочностьюДоГрузовыхМест;


	Возврат Результат;
	
КонецФункции

#КонецОбласти
